Model: "ResNet13"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_10 (InputLayer)           [(None, 32, 32, 3)]  0                                            
__________________________________________________________________________________________________
zero_padding2d_21 (ZeroPadding2 (None, 34, 34, 3)    0           input_10[0][0]                   
__________________________________________________________________________________________________
conv_s3_b1a (Conv2D)            (None, 32, 32, 32)   896         zero_padding2d_21[0][0]          
__________________________________________________________________________________________________
batchN_s3_b1a (BatchNormalizati (None, 32, 32, 32)   128         conv_s3_b1a[0][0]                
__________________________________________________________________________________________________
conv_s3_b1b (Conv2D)            (None, 16, 16, 32)   9248        batchN_s3_b1a[0][0]              
__________________________________________________________________________________________________
conv_s3_b1c (Conv2D)            (None, 16, 16, 32)   896         zero_padding2d_21[0][0]          
__________________________________________________________________________________________________
batchN_s3_b1b (BatchNormalizati (None, 16, 16, 32)   128         conv_s3_b1b[0][0]                
__________________________________________________________________________________________________
batchN_s3_b1c (BatchNormalizati (None, 16, 16, 32)   128         conv_s3_b1c[0][0]                
__________________________________________________________________________________________________
add_81 (Add)                    (None, 16, 16, 32)   0           batchN_s3_b1b[0][0]              
                                                                 batchN_s3_b1c[0][0]              
__________________________________________________________________________________________________
activation_81 (Activation)      (None, 16, 16, 32)   0           add_81[0][0]                     
__________________________________________________________________________________________________
conv_s3_b2a (Conv2D)            (None, 16, 16, 32)   9248        activation_81[0][0]              
__________________________________________________________________________________________________
batchN_s3_b2a (BatchNormalizati (None, 16, 16, 32)   128         conv_s3_b2a[0][0]                
__________________________________________________________________________________________________
conv_s3_b2b (Conv2D)            (None, 16, 16, 32)   9248        batchN_s3_b2a[0][0]              
__________________________________________________________________________________________________
batchN_s3_b2b (BatchNormalizati (None, 16, 16, 32)   128         conv_s3_b2b[0][0]                
__________________________________________________________________________________________________
add_82 (Add)                    (None, 16, 16, 32)   0           batchN_s3_b2b[0][0]              
                                                                 activation_81[0][0]              
__________________________________________________________________________________________________
activation_82 (Activation)      (None, 16, 16, 32)   0           add_82[0][0]                     
__________________________________________________________________________________________________
conv_s3_b3a (Conv2D)            (None, 16, 16, 32)   9248        activation_82[0][0]              
__________________________________________________________________________________________________
batchN_s3_b3a (BatchNormalizati (None, 16, 16, 32)   128         conv_s3_b3a[0][0]                
__________________________________________________________________________________________________
conv_s3_b3b (Conv2D)            (None, 16, 16, 32)   9248        batchN_s3_b3a[0][0]              
__________________________________________________________________________________________________
batchN_s3_b3b (BatchNormalizati (None, 16, 16, 32)   128         conv_s3_b3b[0][0]                
__________________________________________________________________________________________________
add_83 (Add)                    (None, 16, 16, 32)   0           batchN_s3_b3b[0][0]              
                                                                 activation_82[0][0]              
__________________________________________________________________________________________________
activation_83 (Activation)      (None, 16, 16, 32)   0           add_83[0][0]                     
__________________________________________________________________________________________________
zero_padding2d_22 (ZeroPadding2 (None, 18, 18, 32)   0           activation_83[0][0]              
__________________________________________________________________________________________________
conv_s4_b1a (Conv2D)            (None, 16, 16, 64)   18496       zero_padding2d_22[0][0]          
__________________________________________________________________________________________________
batchN_s4_b1a (BatchNormalizati (None, 16, 16, 64)   256         conv_s4_b1a[0][0]                
__________________________________________________________________________________________________
conv_s4_b1b (Conv2D)            (None, 8, 8, 64)     36928       batchN_s4_b1a[0][0]              
__________________________________________________________________________________________________
conv_s4_b1c (Conv2D)            (None, 8, 8, 64)     18496       zero_padding2d_22[0][0]          
__________________________________________________________________________________________________
batchN_s4_b1b (BatchNormalizati (None, 8, 8, 64)     256         conv_s4_b1b[0][0]                
__________________________________________________________________________________________________
batchN_s4_b1c (BatchNormalizati (None, 8, 8, 64)     256         conv_s4_b1c[0][0]                
__________________________________________________________________________________________________
add_84 (Add)                    (None, 8, 8, 64)     0           batchN_s4_b1b[0][0]              
                                                                 batchN_s4_b1c[0][0]              
__________________________________________________________________________________________________
activation_84 (Activation)      (None, 8, 8, 64)     0           add_84[0][0]                     
__________________________________________________________________________________________________
conv_s4_b2a (Conv2D)            (None, 8, 8, 64)     36928       activation_84[0][0]              
__________________________________________________________________________________________________
batchN_s4_b2a (BatchNormalizati (None, 8, 8, 64)     256         conv_s4_b2a[0][0]                
__________________________________________________________________________________________________
conv_s4_b2b (Conv2D)            (None, 8, 8, 64)     36928       batchN_s4_b2a[0][0]              
__________________________________________________________________________________________________
batchN_s4_b2b (BatchNormalizati (None, 8, 8, 64)     256         conv_s4_b2b[0][0]                
__________________________________________________________________________________________________
add_85 (Add)                    (None, 8, 8, 64)     0           batchN_s4_b2b[0][0]              
                                                                 activation_84[0][0]              
__________________________________________________________________________________________________
activation_85 (Activation)      (None, 8, 8, 64)     0           add_85[0][0]                     
__________________________________________________________________________________________________
conv_s4_b3a (Conv2D)            (None, 8, 8, 64)     36928       activation_85[0][0]              
__________________________________________________________________________________________________
batchN_s4_b3a (BatchNormalizati (None, 8, 8, 64)     256         conv_s4_b3a[0][0]                
__________________________________________________________________________________________________
conv_s4_b3b (Conv2D)            (None, 8, 8, 64)     36928       batchN_s4_b3a[0][0]              
__________________________________________________________________________________________________
batchN_s4_b3b (BatchNormalizati (None, 8, 8, 64)     256         conv_s4_b3b[0][0]                
__________________________________________________________________________________________________
add_86 (Add)                    (None, 8, 8, 64)     0           batchN_s4_b3b[0][0]              
                                                                 activation_85[0][0]              
__________________________________________________________________________________________________
activation_86 (Activation)      (None, 8, 8, 64)     0           add_86[0][0]                     
__________________________________________________________________________________________________
globalavg_pool (GlobalAveragePo (None, 64)           0           activation_86[0][0]              
__________________________________________________________________________________________________
flatten_8 (Flatten)             (None, 64)           0           globalavg_pool[0][0]             
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 10)           650         flatten_8[0][0]                  
==================================================================================================
Total params: 273,002
Trainable params: 271,658
Non-trainable params: 1,344
__________________________________________________________________________________________________

Epoch 00001: LearningRateScheduler reducing learning rate to 0.1.
Epoch 1/165
391/391 [==============================] - 41s 106ms/step - loss: 1.6259 - accuracy: 0.4565 - val_loss: 1.7279 - val_accuracy: 0.4628 - lr: 0.1000

Epoch 00002: LearningRateScheduler reducing learning rate to 0.1.
Epoch 2/165
391/391 [==============================] - 43s 109ms/step - loss: 1.2001 - accuracy: 0.6245 - val_loss: 1.2331 - val_accuracy: 0.6258 - lr: 0.1000

Epoch 00003: LearningRateScheduler reducing learning rate to 0.1.
Epoch 3/165
391/391 [==============================] - 43s 109ms/step - loss: 1.0179 - accuracy: 0.6979 - val_loss: 1.2921 - val_accuracy: 0.6351 - lr: 0.1000

Epoch 00004: LearningRateScheduler reducing learning rate to 0.1.
Epoch 4/165
391/391 [==============================] - 43s 110ms/step - loss: 0.9228 - accuracy: 0.7363 - val_loss: 1.0883 - val_accuracy: 0.6848 - lr: 0.1000

Epoch 00005: LearningRateScheduler reducing learning rate to 0.1.
Epoch 5/165
391/391 [==============================] - 44s 112ms/step - loss: 0.8508 - accuracy: 0.7627 - val_loss: 1.5286 - val_accuracy: 0.5836 - lr: 0.1000

Epoch 00006: LearningRateScheduler reducing learning rate to 0.1.
Epoch 6/165
391/391 [==============================] - 44s 112ms/step - loss: 0.8076 - accuracy: 0.7818 - val_loss: 1.0474 - val_accuracy: 0.7183 - lr: 0.1000

Epoch 00007: LearningRateScheduler reducing learning rate to 0.1.
Epoch 7/165
391/391 [==============================] - 43s 111ms/step - loss: 0.7759 - accuracy: 0.7947 - val_loss: 0.9290 - val_accuracy: 0.7526 - lr: 0.1000

Epoch 00008: LearningRateScheduler reducing learning rate to 0.1.
Epoch 8/165
391/391 [==============================] - 43s 111ms/step - loss: 0.7435 - accuracy: 0.8059 - val_loss: 0.8777 - val_accuracy: 0.7684 - lr: 0.1000

Epoch 00009: LearningRateScheduler reducing learning rate to 0.1.
Epoch 9/165
391/391 [==============================] - 43s 111ms/step - loss: 0.7228 - accuracy: 0.8143 - val_loss: 1.3977 - val_accuracy: 0.6487 - lr: 0.1000

Epoch 00010: LearningRateScheduler reducing learning rate to 0.1.
Epoch 10/165
391/391 [==============================] - 43s 110ms/step - loss: 0.7052 - accuracy: 0.8208 - val_loss: 0.8050 - val_accuracy: 0.7970 - lr: 0.1000

Epoch 00011: LearningRateScheduler reducing learning rate to 0.1.
Epoch 11/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6890 - accuracy: 0.8287 - val_loss: 0.8216 - val_accuracy: 0.7882 - lr: 0.1000

Epoch 00012: LearningRateScheduler reducing learning rate to 0.1.
Epoch 12/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6781 - accuracy: 0.8333 - val_loss: 1.1270 - val_accuracy: 0.7236 - lr: 0.1000

Epoch 00013: LearningRateScheduler reducing learning rate to 0.1.
Epoch 13/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6581 - accuracy: 0.8410 - val_loss: 1.0424 - val_accuracy: 0.7169 - lr: 0.1000

Epoch 00014: LearningRateScheduler reducing learning rate to 0.1.
Epoch 14/165
391/391 [==============================] - 44s 112ms/step - loss: 0.6569 - accuracy: 0.8418 - val_loss: 0.8595 - val_accuracy: 0.7906 - lr: 0.1000

Epoch 00015: LearningRateScheduler reducing learning rate to 0.1.
Epoch 15/165
391/391 [==============================] - 44s 114ms/step - loss: 0.6577 - accuracy: 0.8426 - val_loss: 0.8162 - val_accuracy: 0.7930 - lr: 0.1000

Epoch 00016: LearningRateScheduler reducing learning rate to 0.1.
Epoch 16/165
391/391 [==============================] - 44s 113ms/step - loss: 0.6400 - accuracy: 0.8490 - val_loss: 0.9066 - val_accuracy: 0.7731 - lr: 0.1000

Epoch 00017: LearningRateScheduler reducing learning rate to 0.1.
Epoch 17/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6346 - accuracy: 0.8516 - val_loss: 0.8856 - val_accuracy: 0.7754 - lr: 0.1000

Epoch 00018: LearningRateScheduler reducing learning rate to 0.1.
Epoch 18/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6226 - accuracy: 0.8557 - val_loss: 0.9221 - val_accuracy: 0.7821 - lr: 0.1000

Epoch 00019: LearningRateScheduler reducing learning rate to 0.1.
Epoch 19/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6223 - accuracy: 0.8572 - val_loss: 0.9556 - val_accuracy: 0.7735 - lr: 0.1000

Epoch 00020: LearningRateScheduler reducing learning rate to 0.1.
Epoch 20/165
391/391 [==============================] - 43s 110ms/step - loss: 0.6174 - accuracy: 0.8588 - val_loss: 0.9077 - val_accuracy: 0.7750 - lr: 0.1000

Epoch 00021: LearningRateScheduler reducing learning rate to 0.1.
Epoch 21/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6154 - accuracy: 0.8600 - val_loss: 1.0506 - val_accuracy: 0.7420 - lr: 0.1000

Epoch 00022: LearningRateScheduler reducing learning rate to 0.1.
Epoch 22/165
391/391 [==============================] - 44s 112ms/step - loss: 0.6079 - accuracy: 0.8620 - val_loss: 0.7432 - val_accuracy: 0.8158 - lr: 0.1000

Epoch 00023: LearningRateScheduler reducing learning rate to 0.1.
Epoch 23/165
391/391 [==============================] - 44s 111ms/step - loss: 0.5991 - accuracy: 0.8670 - val_loss: 1.1784 - val_accuracy: 0.7211 - lr: 0.1000

Epoch 00024: LearningRateScheduler reducing learning rate to 0.1.
Epoch 24/165
391/391 [==============================] - 43s 111ms/step - loss: 0.6008 - accuracy: 0.8652 - val_loss: 1.1845 - val_accuracy: 0.7181 - lr: 0.1000

Epoch 00025: LearningRateScheduler reducing learning rate to 0.1.
Epoch 25/165
391/391 [==============================] - 44s 112ms/step - loss: 0.6076 - accuracy: 0.8624 - val_loss: 0.9902 - val_accuracy: 0.7695 - lr: 0.1000

Epoch 00026: LearningRateScheduler reducing learning rate to 0.1.
Epoch 26/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5935 - accuracy: 0.8685 - val_loss: 0.8364 - val_accuracy: 0.7944 - lr: 0.1000

Epoch 00027: LearningRateScheduler reducing learning rate to 0.1.
Epoch 27/165
391/391 [==============================] - 45s 114ms/step - loss: 0.5943 - accuracy: 0.8695 - val_loss: 0.8435 - val_accuracy: 0.8026 - lr: 0.1000

Epoch 00028: LearningRateScheduler reducing learning rate to 0.1.
Epoch 28/165
391/391 [==============================] - 44s 113ms/step - loss: 0.5937 - accuracy: 0.8702 - val_loss: 0.9885 - val_accuracy: 0.7584 - lr: 0.1000

Epoch 00029: LearningRateScheduler reducing learning rate to 0.1.
Epoch 29/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5898 - accuracy: 0.8706 - val_loss: 0.9187 - val_accuracy: 0.7819 - lr: 0.1000

Epoch 00030: LearningRateScheduler reducing learning rate to 0.1.
Epoch 30/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5915 - accuracy: 0.8724 - val_loss: 1.2394 - val_accuracy: 0.7082 - lr: 0.1000

Epoch 00031: LearningRateScheduler reducing learning rate to 0.1.
Epoch 31/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5872 - accuracy: 0.8733 - val_loss: 1.0834 - val_accuracy: 0.7650 - lr: 0.1000

Epoch 00032: LearningRateScheduler reducing learning rate to 0.1.
Epoch 32/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5850 - accuracy: 0.8744 - val_loss: 0.7239 - val_accuracy: 0.8360 - lr: 0.1000

Epoch 00033: LearningRateScheduler reducing learning rate to 0.1.
Epoch 33/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5845 - accuracy: 0.8744 - val_loss: 0.9362 - val_accuracy: 0.7636 - lr: 0.1000

Epoch 00034: LearningRateScheduler reducing learning rate to 0.1.
Epoch 34/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5778 - accuracy: 0.8786 - val_loss: 0.8204 - val_accuracy: 0.8047 - lr: 0.1000

Epoch 00035: LearningRateScheduler reducing learning rate to 0.1.
Epoch 35/165
391/391 [==============================] - 44s 111ms/step - loss: 0.5856 - accuracy: 0.8741 - val_loss: 0.8939 - val_accuracy: 0.7889 - lr: 0.1000

Epoch 00036: LearningRateScheduler reducing learning rate to 0.1.
Epoch 36/165
391/391 [==============================] - 44s 113ms/step - loss: 0.5807 - accuracy: 0.8769 - val_loss: 0.8319 - val_accuracy: 0.7998 - lr: 0.1000

Epoch 00037: LearningRateScheduler reducing learning rate to 0.1.
Epoch 37/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5794 - accuracy: 0.8784 - val_loss: 1.3657 - val_accuracy: 0.6864 - lr: 0.1000

Epoch 00038: LearningRateScheduler reducing learning rate to 0.1.
Epoch 38/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5789 - accuracy: 0.8773 - val_loss: 0.9704 - val_accuracy: 0.7706 - lr: 0.1000

Epoch 00039: LearningRateScheduler reducing learning rate to 0.1.
Epoch 39/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5823 - accuracy: 0.8779 - val_loss: 0.8100 - val_accuracy: 0.8035 - lr: 0.1000

Epoch 00040: LearningRateScheduler reducing learning rate to 0.1.
Epoch 40/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5721 - accuracy: 0.8800 - val_loss: 0.7354 - val_accuracy: 0.8347 - lr: 0.1000

Epoch 00041: LearningRateScheduler reducing learning rate to 0.1.
Epoch 41/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5731 - accuracy: 0.8796 - val_loss: 1.0676 - val_accuracy: 0.7612 - lr: 0.1000

Epoch 00042: LearningRateScheduler reducing learning rate to 0.1.
Epoch 42/165
391/391 [==============================] - 44s 111ms/step - loss: 0.5720 - accuracy: 0.8798 - val_loss: 0.8254 - val_accuracy: 0.8050 - lr: 0.1000

Epoch 00043: LearningRateScheduler reducing learning rate to 0.1.
Epoch 43/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5766 - accuracy: 0.8786 - val_loss: 1.5929 - val_accuracy: 0.6230 - lr: 0.1000

Epoch 00044: LearningRateScheduler reducing learning rate to 0.1.
Epoch 44/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5718 - accuracy: 0.8816 - val_loss: 0.9746 - val_accuracy: 0.7693 - lr: 0.1000

Epoch 00045: LearningRateScheduler reducing learning rate to 0.1.
Epoch 45/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5730 - accuracy: 0.8807 - val_loss: 0.9401 - val_accuracy: 0.7765 - lr: 0.1000

Epoch 00046: LearningRateScheduler reducing learning rate to 0.1.
Epoch 46/165
391/391 [==============================] - 45s 114ms/step - loss: 0.5640 - accuracy: 0.8850 - val_loss: 1.0114 - val_accuracy: 0.7751 - lr: 0.1000

Epoch 00047: LearningRateScheduler reducing learning rate to 0.1.
Epoch 47/165
391/391 [==============================] - 44s 113ms/step - loss: 0.5653 - accuracy: 0.8837 - val_loss: 1.8888 - val_accuracy: 0.6076 - lr: 0.1000

Epoch 00048: LearningRateScheduler reducing learning rate to 0.1.
Epoch 48/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5675 - accuracy: 0.8843 - val_loss: 0.8927 - val_accuracy: 0.7792 - lr: 0.1000

Epoch 00049: LearningRateScheduler reducing learning rate to 0.1.
Epoch 49/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5680 - accuracy: 0.8849 - val_loss: 0.8917 - val_accuracy: 0.8008 - lr: 0.1000

Epoch 00050: LearningRateScheduler reducing learning rate to 0.1.
Epoch 50/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5648 - accuracy: 0.8832 - val_loss: 0.9161 - val_accuracy: 0.7767 - lr: 0.1000

Epoch 00051: LearningRateScheduler reducing learning rate to 0.1.
Epoch 51/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5686 - accuracy: 0.8823 - val_loss: 0.9140 - val_accuracy: 0.7839 - lr: 0.1000

Epoch 00052: LearningRateScheduler reducing learning rate to 0.1.
Epoch 52/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5633 - accuracy: 0.8864 - val_loss: 0.8476 - val_accuracy: 0.8083 - lr: 0.1000

Epoch 00053: LearningRateScheduler reducing learning rate to 0.1.
Epoch 53/165
391/391 [==============================] - 44s 111ms/step - loss: 0.5607 - accuracy: 0.8862 - val_loss: 0.9938 - val_accuracy: 0.7849 - lr: 0.1000

Epoch 00054: LearningRateScheduler reducing learning rate to 0.1.
Epoch 54/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5672 - accuracy: 0.8849 - val_loss: 0.9234 - val_accuracy: 0.7804 - lr: 0.1000

Epoch 00055: LearningRateScheduler reducing learning rate to 0.1.
Epoch 55/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5667 - accuracy: 0.8853 - val_loss: 0.8964 - val_accuracy: 0.7996 - lr: 0.1000

Epoch 00056: LearningRateScheduler reducing learning rate to 0.1.
Epoch 56/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5592 - accuracy: 0.8879 - val_loss: 0.9281 - val_accuracy: 0.7859 - lr: 0.1000

Epoch 00057: LearningRateScheduler reducing learning rate to 0.1.
Epoch 57/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5593 - accuracy: 0.8881 - val_loss: 1.5520 - val_accuracy: 0.6857 - lr: 0.1000

Epoch 00058: LearningRateScheduler reducing learning rate to 0.1.
Epoch 58/165
391/391 [==============================] - 45s 114ms/step - loss: 0.5567 - accuracy: 0.8887 - val_loss: 0.7892 - val_accuracy: 0.8208 - lr: 0.1000

Epoch 00059: LearningRateScheduler reducing learning rate to 0.1.
Epoch 59/165
391/391 [==============================] - 44s 113ms/step - loss: 0.5550 - accuracy: 0.8903 - val_loss: 0.8054 - val_accuracy: 0.8138 - lr: 0.1000

Epoch 00060: LearningRateScheduler reducing learning rate to 0.1.
Epoch 60/165
391/391 [==============================] - 44s 111ms/step - loss: 0.5609 - accuracy: 0.8881 - val_loss: 0.8577 - val_accuracy: 0.7992 - lr: 0.1000

Epoch 00061: LearningRateScheduler reducing learning rate to 0.1.
Epoch 61/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5563 - accuracy: 0.8897 - val_loss: 1.1790 - val_accuracy: 0.7371 - lr: 0.1000

Epoch 00062: LearningRateScheduler reducing learning rate to 0.1.
Epoch 62/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5575 - accuracy: 0.8880 - val_loss: 0.7301 - val_accuracy: 0.8401 - lr: 0.1000

Epoch 00063: LearningRateScheduler reducing learning rate to 0.1.
Epoch 63/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5540 - accuracy: 0.8898 - val_loss: 0.9868 - val_accuracy: 0.7694 - lr: 0.1000

Epoch 00064: LearningRateScheduler reducing learning rate to 0.1.
Epoch 64/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5516 - accuracy: 0.8896 - val_loss: 0.8978 - val_accuracy: 0.7976 - lr: 0.1000

Epoch 00065: LearningRateScheduler reducing learning rate to 0.1.
Epoch 65/165
391/391 [==============================] - 44s 111ms/step - loss: 0.5505 - accuracy: 0.8917 - val_loss: 0.8123 - val_accuracy: 0.8247 - lr: 0.1000

Epoch 00066: LearningRateScheduler reducing learning rate to 0.1.
Epoch 66/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5528 - accuracy: 0.8903 - val_loss: 0.9635 - val_accuracy: 0.7644 - lr: 0.1000

Epoch 00067: LearningRateScheduler reducing learning rate to 0.1.
Epoch 67/165
391/391 [==============================] - 44s 111ms/step - loss: 0.5546 - accuracy: 0.8898 - val_loss: 0.8656 - val_accuracy: 0.8014 - lr: 0.1000

Epoch 00068: LearningRateScheduler reducing learning rate to 0.1.
Epoch 68/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5514 - accuracy: 0.8898 - val_loss: 1.0445 - val_accuracy: 0.7507 - lr: 0.1000

Epoch 00069: LearningRateScheduler reducing learning rate to 0.1.
Epoch 69/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5546 - accuracy: 0.8904 - val_loss: 0.9758 - val_accuracy: 0.7901 - lr: 0.1000

Epoch 00070: LearningRateScheduler reducing learning rate to 0.1.
Epoch 70/165
391/391 [==============================] - 45s 114ms/step - loss: 0.5470 - accuracy: 0.8925 - val_loss: 0.8728 - val_accuracy: 0.8144 - lr: 0.1000

Epoch 00071: LearningRateScheduler reducing learning rate to 0.1.
Epoch 71/165
391/391 [==============================] - 45s 114ms/step - loss: 0.5520 - accuracy: 0.8909 - val_loss: 0.8408 - val_accuracy: 0.8163 - lr: 0.1000

Epoch 00072: LearningRateScheduler reducing learning rate to 0.1.
Epoch 72/165
391/391 [==============================] - 44s 112ms/step - loss: 0.5538 - accuracy: 0.8904 - val_loss: 0.8802 - val_accuracy: 0.8010 - lr: 0.1000

Epoch 00073: LearningRateScheduler reducing learning rate to 0.1.
Epoch 73/165
391/391 [==============================] - 44s 113ms/step - loss: 0.5493 - accuracy: 0.8922 - val_loss: 0.8555 - val_accuracy: 0.8100 - lr: 0.1000

Epoch 00074: LearningRateScheduler reducing learning rate to 0.1.
Epoch 74/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5493 - accuracy: 0.8938 - val_loss: 0.8215 - val_accuracy: 0.8175 - lr: 0.1000

Epoch 00075: LearningRateScheduler reducing learning rate to 0.1.
Epoch 75/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5456 - accuracy: 0.8945 - val_loss: 1.1000 - val_accuracy: 0.7664 - lr: 0.1000

Epoch 00076: LearningRateScheduler reducing learning rate to 0.1.
Epoch 76/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5498 - accuracy: 0.8904 - val_loss: 1.1507 - val_accuracy: 0.7529 - lr: 0.1000

Epoch 00077: LearningRateScheduler reducing learning rate to 0.1.
Epoch 77/165
391/391 [==============================] - 43s 109ms/step - loss: 0.5488 - accuracy: 0.8924 - val_loss: 0.7791 - val_accuracy: 0.8264 - lr: 0.1000

Epoch 00078: LearningRateScheduler reducing learning rate to 0.1.
Epoch 78/165
391/391 [==============================] - 43s 110ms/step - loss: 0.5510 - accuracy: 0.8903 - val_loss: 1.0304 - val_accuracy: 0.7592 - lr: 0.1000

Epoch 00079: LearningRateScheduler reducing learning rate to 0.1.
Epoch 79/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5448 - accuracy: 0.8936 - val_loss: 0.8336 - val_accuracy: 0.8085 - lr: 0.1000

Epoch 00080: LearningRateScheduler reducing learning rate to 0.1.
Epoch 80/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5516 - accuracy: 0.8919 - val_loss: 0.7595 - val_accuracy: 0.8287 - lr: 0.1000

Epoch 00081: LearningRateScheduler reducing learning rate to 0.1.
Epoch 81/165
391/391 [==============================] - 43s 111ms/step - loss: 0.5469 - accuracy: 0.8939 - val_loss: 0.7282 - val_accuracy: 0.8354 - lr: 0.1000

Epoch 00082: LearningRateScheduler reducing learning rate to 0.01.
Epoch 82/165
391/391 [==============================] - 44s 112ms/step - loss: 0.4703 - accuracy: 0.9201 - val_loss: 0.5876 - val_accuracy: 0.8856 - lr: 0.0100

Epoch 00083: LearningRateScheduler reducing learning rate to 0.01.
Epoch 83/165
391/391 [==============================] - 45s 114ms/step - loss: 0.4217 - accuracy: 0.9362 - val_loss: 0.5719 - val_accuracy: 0.8906 - lr: 0.0100

Epoch 00084: LearningRateScheduler reducing learning rate to 0.01.
Epoch 84/165
391/391 [==============================] - 45s 115ms/step - loss: 0.4036 - accuracy: 0.9406 - val_loss: 0.5538 - val_accuracy: 0.8943 - lr: 0.0100

Epoch 00085: LearningRateScheduler reducing learning rate to 0.01.
Epoch 85/165
391/391 [==============================] - 43s 110ms/step - loss: 0.3896 - accuracy: 0.9450 - val_loss: 0.5539 - val_accuracy: 0.8942 - lr: 0.0100

Epoch 00086: LearningRateScheduler reducing learning rate to 0.01.
Epoch 86/165
391/391 [==============================] - 43s 111ms/step - loss: 0.3820 - accuracy: 0.9454 - val_loss: 0.5446 - val_accuracy: 0.8987 - lr: 0.0100

Epoch 00087: LearningRateScheduler reducing learning rate to 0.01.
Epoch 87/165
391/391 [==============================] - 44s 111ms/step - loss: 0.3710 - accuracy: 0.9483 - val_loss: 0.5442 - val_accuracy: 0.8960 - lr: 0.0100

Epoch 00088: LearningRateScheduler reducing learning rate to 0.01.
Epoch 88/165
391/391 [==============================] - 44s 112ms/step - loss: 0.3603 - accuracy: 0.9509 - val_loss: 0.5426 - val_accuracy: 0.8974 - lr: 0.0100

Epoch 00089: LearningRateScheduler reducing learning rate to 0.01.
Epoch 89/165
391/391 [==============================] - 44s 113ms/step - loss: 0.3535 - accuracy: 0.9522 - val_loss: 0.5512 - val_accuracy: 0.8957 - lr: 0.0100

Epoch 00090: LearningRateScheduler reducing learning rate to 0.01.
Epoch 90/165
391/391 [==============================] - 44s 113ms/step - loss: 0.3471 - accuracy: 0.9534 - val_loss: 0.5403 - val_accuracy: 0.8973 - lr: 0.0100

Epoch 00091: LearningRateScheduler reducing learning rate to 0.01.
Epoch 91/165
391/391 [==============================] - 44s 113ms/step - loss: 0.3401 - accuracy: 0.9540 - val_loss: 0.5360 - val_accuracy: 0.9001 - lr: 0.0100

Epoch 00092: LearningRateScheduler reducing learning rate to 0.01.
Epoch 92/165
391/391 [==============================] - 44s 112ms/step - loss: 0.3320 - accuracy: 0.9555 - val_loss: 0.5184 - val_accuracy: 0.9041 - lr: 0.0100

Epoch 00093: LearningRateScheduler reducing learning rate to 0.01.
Epoch 93/165
391/391 [==============================] - 44s 112ms/step - loss: 0.3255 - accuracy: 0.9579 - val_loss: 0.5372 - val_accuracy: 0.8984 - lr: 0.0100

Epoch 00094: LearningRateScheduler reducing learning rate to 0.01.
Epoch 94/165
391/391 [==============================] - 44s 112ms/step - loss: 0.3194 - accuracy: 0.9587 - val_loss: 0.5278 - val_accuracy: 0.8994 - lr: 0.0100

Epoch 00095: LearningRateScheduler reducing learning rate to 0.01.
Epoch 95/165
391/391 [==============================] - 43s 111ms/step - loss: 0.3168 - accuracy: 0.9588 - val_loss: 0.5426 - val_accuracy: 0.8980 - lr: 0.0100

Epoch 00096: LearningRateScheduler reducing learning rate to 0.01.
Epoch 96/165
391/391 [==============================] - 43s 110ms/step - loss: 0.3099 - accuracy: 0.9607 - val_loss: 0.5252 - val_accuracy: 0.9022 - lr: 0.0100

Epoch 00097: LearningRateScheduler reducing learning rate to 0.01.
Epoch 97/165
391/391 [==============================] - 43s 110ms/step - loss: 0.3049 - accuracy: 0.9607 - val_loss: 0.5288 - val_accuracy: 0.9007 - lr: 0.0100

Epoch 00098: LearningRateScheduler reducing learning rate to 0.01.
Epoch 98/165
391/391 [==============================] - 43s 111ms/step - loss: 0.3023 - accuracy: 0.9616 - val_loss: 0.5333 - val_accuracy: 0.8998 - lr: 0.0100

Epoch 00099: LearningRateScheduler reducing learning rate to 0.01.
Epoch 99/165
391/391 [==============================] - 43s 111ms/step - loss: 0.2948 - accuracy: 0.9624 - val_loss: 0.5406 - val_accuracy: 0.8987 - lr: 0.0100

Epoch 00100: LearningRateScheduler reducing learning rate to 0.01.
Epoch 100/165
391/391 [==============================] - 44s 112ms/step - loss: 0.2935 - accuracy: 0.9621 - val_loss: 0.5331 - val_accuracy: 0.8989 - lr: 0.0100

Epoch 00101: LearningRateScheduler reducing learning rate to 0.01.
Epoch 101/165
391/391 [==============================] - 43s 110ms/step - loss: 0.2877 - accuracy: 0.9629 - val_loss: 0.5380 - val_accuracy: 0.8977 - lr: 0.0100

Epoch 00102: LearningRateScheduler reducing learning rate to 0.01.
Epoch 102/165
391/391 [==============================] - 43s 109ms/step - loss: 0.2831 - accuracy: 0.9632 - val_loss: 0.5362 - val_accuracy: 0.8976 - lr: 0.0100

Epoch 00103: LearningRateScheduler reducing learning rate to 0.01.
Epoch 103/165
391/391 [==============================] - 44s 112ms/step - loss: 0.2774 - accuracy: 0.9653 - val_loss: 0.5329 - val_accuracy: 0.8979 - lr: 0.0100

Epoch 00104: LearningRateScheduler reducing learning rate to 0.01.
Epoch 104/165
391/391 [==============================] - 43s 110ms/step - loss: 0.2748 - accuracy: 0.9650 - val_loss: 0.5304 - val_accuracy: 0.8990 - lr: 0.0100

Epoch 00105: LearningRateScheduler reducing learning rate to 0.01.
Epoch 105/165
391/391 [==============================] - 43s 111ms/step - loss: 0.2718 - accuracy: 0.9654 - val_loss: 0.5234 - val_accuracy: 0.9005 - lr: 0.0100

Epoch 00106: LearningRateScheduler reducing learning rate to 0.01.
Epoch 106/165
391/391 [==============================] - 43s 109ms/step - loss: 0.2668 - accuracy: 0.9669 - val_loss: 0.5208 - val_accuracy: 0.9025 - lr: 0.0100

Epoch 00107: LearningRateScheduler reducing learning rate to 0.01.
Epoch 107/165
391/391 [==============================] - 43s 111ms/step - loss: 0.2626 - accuracy: 0.9665 - val_loss: 0.5656 - val_accuracy: 0.8906 - lr: 0.0100

Epoch 00108: LearningRateScheduler reducing learning rate to 0.01.
Epoch 108/165
391/391 [==============================] - 44s 111ms/step - loss: 0.2605 - accuracy: 0.9674 - val_loss: 0.5533 - val_accuracy: 0.8932 - lr: 0.0100

Epoch 00109: LearningRateScheduler reducing learning rate to 0.01.
Epoch 109/165
391/391 [==============================] - 43s 110ms/step - loss: 0.2589 - accuracy: 0.9670 - val_loss: 0.5382 - val_accuracy: 0.9007 - lr: 0.0100

Epoch 00110: LearningRateScheduler reducing learning rate to 0.01.
Epoch 110/165
391/391 [==============================] - 43s 111ms/step - loss: 0.2532 - accuracy: 0.9681 - val_loss: 0.5412 - val_accuracy: 0.8986 - lr: 0.0100

Epoch 00111: LearningRateScheduler reducing learning rate to 0.01.
Epoch 111/165
391/391 [==============================] - 43s 110ms/step - loss: 0.2508 - accuracy: 0.9680 - val_loss: 0.5338 - val_accuracy: 0.8973 - lr: 0.0100

Epoch 00112: LearningRateScheduler reducing learning rate to 0.01.
Epoch 112/165
391/391 [==============================] - 43s 110ms/step - loss: 0.2476 - accuracy: 0.9692 - val_loss: 0.5093 - val_accuracy: 0.9043 - lr: 0.0100

Epoch 00113: LearningRateScheduler reducing learning rate to 0.01.
Epoch 113/165
391/391 [==============================] - 44s 113ms/step - loss: 0.2451 - accuracy: 0.9689 - val_loss: 0.5385 - val_accuracy: 0.8958 - lr: 0.0100

Epoch 00114: LearningRateScheduler reducing learning rate to 0.01.
Epoch 114/165
391/391 [==============================] - 44s 111ms/step - loss: 0.2406 - accuracy: 0.9702 - val_loss: 0.5854 - val_accuracy: 0.8906 - lr: 0.0100

Epoch 00115: LearningRateScheduler reducing learning rate to 0.01.
Epoch 115/165
391/391 [==============================] - 44s 113ms/step - loss: 0.2410 - accuracy: 0.9690 - val_loss: 0.5512 - val_accuracy: 0.8935 - lr: 0.0100

Epoch 00116: LearningRateScheduler reducing learning rate to 0.01.
Epoch 116/165
391/391 [==============================] - 44s 112ms/step - loss: 0.2359 - accuracy: 0.9705 - val_loss: 0.5382 - val_accuracy: 0.8943 - lr: 0.0100

Epoch 00117: LearningRateScheduler reducing learning rate to 0.01.
Epoch 117/165
391/391 [==============================] - 44s 112ms/step - loss: 0.2360 - accuracy: 0.9696 - val_loss: 0.5314 - val_accuracy: 0.8956 - lr: 0.0100

Epoch 00118: LearningRateScheduler reducing learning rate to 0.01.
Epoch 118/165
391/391 [==============================] - 44s 112ms/step - loss: 0.2322 - accuracy: 0.9699 - val_loss: 0.5473 - val_accuracy: 0.8932 - lr: 0.0100

Epoch 00119: LearningRateScheduler reducing learning rate to 0.01.
Epoch 119/165
391/391 [==============================] - 43s 110ms/step - loss: 0.2305 - accuracy: 0.9692 - val_loss: 0.5272 - val_accuracy: 0.8987 - lr: 0.0100

Epoch 00120: LearningRateScheduler reducing learning rate to 0.01.
Epoch 120/165
391/391 [==============================] - 42s 108ms/step - loss: 0.2300 - accuracy: 0.9694 - val_loss: 0.5309 - val_accuracy: 0.8978 - lr: 0.0100

Epoch 00121: LearningRateScheduler reducing learning rate to 0.01.
Epoch 121/165
391/391 [==============================] - 43s 111ms/step - loss: 0.2257 - accuracy: 0.9715 - val_loss: 0.5221 - val_accuracy: 0.8976 - lr: 0.0100

Epoch 00122: LearningRateScheduler reducing learning rate to 0.01.
Epoch 122/165
391/391 [==============================] - 44s 112ms/step - loss: 0.2226 - accuracy: 0.9721 - val_loss: 0.5569 - val_accuracy: 0.8936 - lr: 0.0100

Epoch 00123: LearningRateScheduler reducing learning rate to 0.01.
Epoch 123/165
391/391 [==============================] - 43s 111ms/step - loss: 0.2195 - accuracy: 0.9722 - val_loss: 0.5622 - val_accuracy: 0.8925 - lr: 0.0100

Epoch 00124: LearningRateScheduler reducing learning rate to 0.01.
Epoch 124/165
391/391 [==============================] - 43s 111ms/step - loss: 0.2222 - accuracy: 0.9701 - val_loss: 0.5436 - val_accuracy: 0.8930 - lr: 0.0100

Epoch 00125: LearningRateScheduler reducing learning rate to 0.01.
Epoch 125/165
391/391 [==============================] - 44s 111ms/step - loss: 0.2214 - accuracy: 0.9704 - val_loss: 0.5749 - val_accuracy: 0.8891 - lr: 0.0100

Epoch 00126: LearningRateScheduler reducing learning rate to 0.01.
Epoch 126/165
391/391 [==============================] - 45s 114ms/step - loss: 0.2155 - accuracy: 0.9712 - val_loss: 0.5513 - val_accuracy: 0.8933 - lr: 0.0100

Epoch 00127: LearningRateScheduler reducing learning rate to 0.001.
Epoch 127/165
391/391 [==============================] - 44s 111ms/step - loss: 0.2056 - accuracy: 0.9760 - val_loss: 0.5106 - val_accuracy: 0.9017 - lr: 0.0010

Epoch 00128: LearningRateScheduler reducing learning rate to 0.001.
Epoch 128/165
391/391 [==============================] - 44s 113ms/step - loss: 0.1977 - accuracy: 0.9785 - val_loss: 0.5050 - val_accuracy: 0.9039 - lr: 0.0010

Epoch 00129: LearningRateScheduler reducing learning rate to 0.001.
Epoch 129/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1938 - accuracy: 0.9811 - val_loss: 0.4996 - val_accuracy: 0.9046 - lr: 0.0010

Epoch 00130: LearningRateScheduler reducing learning rate to 0.001.
Epoch 130/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1919 - accuracy: 0.9811 - val_loss: 0.4967 - val_accuracy: 0.9054 - lr: 0.0010

Epoch 00131: LearningRateScheduler reducing learning rate to 0.001.
Epoch 131/165
391/391 [==============================] - 43s 109ms/step - loss: 0.1899 - accuracy: 0.9807 - val_loss: 0.4952 - val_accuracy: 0.9052 - lr: 0.0010

Epoch 00132: LearningRateScheduler reducing learning rate to 0.001.
Epoch 132/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1900 - accuracy: 0.9813 - val_loss: 0.4960 - val_accuracy: 0.9062 - lr: 0.0010

Epoch 00133: LearningRateScheduler reducing learning rate to 0.001.
Epoch 133/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1886 - accuracy: 0.9818 - val_loss: 0.4938 - val_accuracy: 0.9047 - lr: 0.0010

Epoch 00134: LearningRateScheduler reducing learning rate to 0.001.
Epoch 134/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1864 - accuracy: 0.9823 - val_loss: 0.4941 - val_accuracy: 0.9059 - lr: 0.0010

Epoch 00135: LearningRateScheduler reducing learning rate to 0.001.
Epoch 135/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1859 - accuracy: 0.9832 - val_loss: 0.4909 - val_accuracy: 0.9063 - lr: 0.0010

Epoch 00136: LearningRateScheduler reducing learning rate to 0.001.
Epoch 136/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1862 - accuracy: 0.9824 - val_loss: 0.4916 - val_accuracy: 0.9063 - lr: 0.0010

Epoch 00137: LearningRateScheduler reducing learning rate to 0.001.
Epoch 137/165
391/391 [==============================] - 44s 111ms/step - loss: 0.1856 - accuracy: 0.9826 - val_loss: 0.4932 - val_accuracy: 0.9055 - lr: 0.0010

Epoch 00138: LearningRateScheduler reducing learning rate to 0.001.
Epoch 138/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1837 - accuracy: 0.9831 - val_loss: 0.4904 - val_accuracy: 0.9062 - lr: 0.0010

Epoch 00139: LearningRateScheduler reducing learning rate to 0.001.
Epoch 139/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1851 - accuracy: 0.9822 - val_loss: 0.4922 - val_accuracy: 0.9061 - lr: 0.0010

Epoch 00140: LearningRateScheduler reducing learning rate to 0.001.
Epoch 140/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1847 - accuracy: 0.9824 - val_loss: 0.4942 - val_accuracy: 0.9062 - lr: 0.0010

Epoch 00141: LearningRateScheduler reducing learning rate to 0.001.
Epoch 141/165
391/391 [==============================] - 45s 114ms/step - loss: 0.1812 - accuracy: 0.9842 - val_loss: 0.4931 - val_accuracy: 0.9057 - lr: 0.0010

Epoch 00142: LearningRateScheduler reducing learning rate to 0.001.
Epoch 142/165
391/391 [==============================] - 45s 115ms/step - loss: 0.1817 - accuracy: 0.9836 - val_loss: 0.4905 - val_accuracy: 0.9069 - lr: 0.0010

Epoch 00143: LearningRateScheduler reducing learning rate to 0.001.
Epoch 143/165
391/391 [==============================] - 44s 112ms/step - loss: 0.1829 - accuracy: 0.9836 - val_loss: 0.4927 - val_accuracy: 0.9062 - lr: 0.0010

Epoch 00144: LearningRateScheduler reducing learning rate to 0.001.
Epoch 144/165
391/391 [==============================] - 44s 112ms/step - loss: 0.1810 - accuracy: 0.9839 - val_loss: 0.4883 - val_accuracy: 0.9081 - lr: 0.0010

Epoch 00145: LearningRateScheduler reducing learning rate to 0.001.
Epoch 145/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1789 - accuracy: 0.9850 - val_loss: 0.4894 - val_accuracy: 0.9080 - lr: 0.0010

Epoch 00146: LearningRateScheduler reducing learning rate to 0.001.
Epoch 146/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1795 - accuracy: 0.9846 - val_loss: 0.4911 - val_accuracy: 0.9074 - lr: 0.0010

Epoch 00147: LearningRateScheduler reducing learning rate to 0.001.
Epoch 147/165
391/391 [==============================] - 43s 109ms/step - loss: 0.1799 - accuracy: 0.9838 - val_loss: 0.4948 - val_accuracy: 0.9071 - lr: 0.0010

Epoch 00148: LearningRateScheduler reducing learning rate to 0.001.
Epoch 148/165
391/391 [==============================] - 44s 112ms/step - loss: 0.1786 - accuracy: 0.9845 - val_loss: 0.4922 - val_accuracy: 0.9062 - lr: 0.0010

Epoch 00149: LearningRateScheduler reducing learning rate to 0.001.
Epoch 149/165
391/391 [==============================] - 44s 112ms/step - loss: 0.1784 - accuracy: 0.9849 - val_loss: 0.4933 - val_accuracy: 0.9064 - lr: 0.0010

Epoch 00150: LearningRateScheduler reducing learning rate to 0.001.
Epoch 150/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1786 - accuracy: 0.9838 - val_loss: 0.4922 - val_accuracy: 0.9067 - lr: 0.0010

Epoch 00151: LearningRateScheduler reducing learning rate to 0.001.
Epoch 151/165
391/391 [==============================] - 44s 113ms/step - loss: 0.1783 - accuracy: 0.9839 - val_loss: 0.4927 - val_accuracy: 0.9060 - lr: 0.0010

Epoch 00152: LearningRateScheduler reducing learning rate to 0.001.
Epoch 152/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1756 - accuracy: 0.9852 - val_loss: 0.4925 - val_accuracy: 0.9058 - lr: 0.0010

Epoch 00153: LearningRateScheduler reducing learning rate to 0.001.
Epoch 153/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1760 - accuracy: 0.9853 - val_loss: 0.4918 - val_accuracy: 0.9058 - lr: 0.0010

Epoch 00154: LearningRateScheduler reducing learning rate to 0.001.
Epoch 154/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1761 - accuracy: 0.9843 - val_loss: 0.4948 - val_accuracy: 0.9079 - lr: 0.0010

Epoch 00155: LearningRateScheduler reducing learning rate to 0.001.
Epoch 155/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1756 - accuracy: 0.9849 - val_loss: 0.4936 - val_accuracy: 0.9062 - lr: 0.0010

Epoch 00156: LearningRateScheduler reducing learning rate to 0.001.
Epoch 156/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1738 - accuracy: 0.9857 - val_loss: 0.4948 - val_accuracy: 0.9047 - lr: 0.0010

Epoch 00157: LearningRateScheduler reducing learning rate to 0.001.
Epoch 157/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1732 - accuracy: 0.9854 - val_loss: 0.4933 - val_accuracy: 0.9060 - lr: 0.0010

Epoch 00158: LearningRateScheduler reducing learning rate to 0.001.
Epoch 158/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1737 - accuracy: 0.9857 - val_loss: 0.4956 - val_accuracy: 0.9064 - lr: 0.0010

Epoch 00159: LearningRateScheduler reducing learning rate to 0.001.
Epoch 159/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1737 - accuracy: 0.9853 - val_loss: 0.4934 - val_accuracy: 0.9073 - lr: 0.0010

Epoch 00160: LearningRateScheduler reducing learning rate to 0.001.
Epoch 160/165
391/391 [==============================] - 44s 113ms/step - loss: 0.1717 - accuracy: 0.9861 - val_loss: 0.4984 - val_accuracy: 0.9045 - lr: 0.0010

Epoch 00161: LearningRateScheduler reducing learning rate to 0.001.
Epoch 161/165
391/391 [==============================] - 44s 111ms/step - loss: 0.1718 - accuracy: 0.9858 - val_loss: 0.4927 - val_accuracy: 0.9078 - lr: 0.0010

Epoch 00162: LearningRateScheduler reducing learning rate to 0.001.
Epoch 162/165
391/391 [==============================] - 44s 112ms/step - loss: 0.1739 - accuracy: 0.9848 - val_loss: 0.4966 - val_accuracy: 0.9058 - lr: 0.0010

Epoch 00163: LearningRateScheduler reducing learning rate to 0.001.
Epoch 163/165
391/391 [==============================] - 43s 111ms/step - loss: 0.1710 - accuracy: 0.9862 - val_loss: 0.4983 - val_accuracy: 0.9037 - lr: 0.0010

Epoch 00164: LearningRateScheduler reducing learning rate to 0.001.
Epoch 164/165
391/391 [==============================] - 44s 112ms/step - loss: 0.1723 - accuracy: 0.9854 - val_loss: 0.4994 - val_accuracy: 0.9055 - lr: 0.0010

Epoch 00165: LearningRateScheduler reducing learning rate to 0.001.
Epoch 165/165
391/391 [==============================] - 43s 110ms/step - loss: 0.1709 - accuracy: 0.9857 - val_loss: 0.4992 - val_accuracy: 0.9048 - lr: 0.0010


>Final Accuracy of Trained Model: 90.480